In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Name" :[
        "홍길동",
        "일지매",
        "성춘향",
    ],
    "Age" : [
        22, 35, 58
    ],
    "Sex" : [
        "남자","여자","여자"    
    ]
    
    
    
    
})

In [3]:
df

  Name  Age Sex
0  홍길동   22  남자
1  일지매   35  여자
2  성춘향   58  여자

__DataFrame__ 다영한 타입의 데이터를 저장 할 수 있는 2차원의 데이터 구조이다.
스프레드시트, SQL레이블, R의 data.frame과 유사하다.
![스프레드시트](https://pandas.pydata.org/docs/_images/01_table_spreadsheet.png)

__DataFrame__ 의 각 칼럼은 __Series__이다
![Series](https://pandas.pydata.org/docs/_images/01_table_series.svg)

dataframe은 여러가지

__Age__ 칼럼의 데이터를 다루고 싶다면

In [4]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

__DataFrame__ 에서 하나의 칼럼을 선택하면, 그 결과는 __Series__ 이다.
하나의 칼럼을 선택하려면 네모 괄호 안에 [] 칼럼 라벨을 적어 주면 된다.

하나의 __Series__ 를 생성하려면 다음과 같이...!

In [5]:
ages = pd.Series([22,35,43], name="Age")

In [6]:
ages

0    22
1    35
2    43
Name: Age, dtype: int64

In [7]:
df["Age"].max()

58

In [8]:
ages.max()

43

In [9]:
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000